# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

a = input('Введите номер дня недели:')
a = int(a)
if (a == 6 or a == 7):
    print('Выходной день!')
elif (0 < a < 6):
    print ('Рабочий день недели')
else: print ('Такого дня недели не существует')
