# 5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

import math
x1 = float(input('Введите координаты точки А по x: '))
y1 = float(input('Введите координаты точки A по y: '))
x2 = float(input('Введите координаты точки B по x: '))
y2 = float(input('Введите координаты точки B по y: '))
A = [x1, y1]
B = [x2, y2]
dist_points = math.sqrt((B[0] - A[0])**2 + (B[1] - A[1])**2)
print(round(dist_points, 3))
